Урок 1. Контрольная работа

Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub

2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)

3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)

4. Написать программу, решающую поставленную задачу

5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

## Разбор кода

Код представляет собой набор методов для работы с массивами строк:

EnterStringsToArray: Этот метод позволяет пользователю ввести определенное количество строк через консоль и сохранить их в массиве.

CreatingArrayStringsLessThan3: Этот метод принимает массив строк и создает новый массив, содержащий только те строки, длина которых меньше или равна 3 символам.

PrintArray: Этот метод принимает массив строк и возвращает его строковое представление.

## Как использовать

1. Вызовите метод EnterStringsToArray, чтобы ввести строки через консоль и сохранить их в массиве.
Вызовите метод 
2. CreatingArrayStringsLessThan3, чтобы получить новый массив, содержащий строки с длиной менее или равной 3 символам.
3. Для получения строкового представления массивов вызовите метод PrintArray.

## Пример использования кода:


string[] workArray = EnterStringsToArray();
string[] result = CreatingArrayStringsLessThan3(workArray);
string firstArray = PrintArray(workArray);
string secondArray = PrintArray(result);
Console.WriteLine(firstArray + " -> " + secondArray);
